{
	"next": "Siguiente",
	"back": "Volver atrás",
	"cancel": "Cancelar",
	"loading": "Cargando",
	"error": "Error",
	"acceptError": "Aceptar",
	"download": "Descargar",
	"actions": "Acciones",
	"weightsVar": "Variable de pesos",
	"home": "Inicio",
	"projectsTab": "Proyectos",
	"loadTab": "Carga de datos",
	"dataTab": "Datos",
	"weightTab": "Ponderación",
	"estimationTab": "Estimación",
	"defaultProject": "Nombre de encuesta por defecto",
	"defaultProjectDesc": "Descripción de encuesta por defecto",
	"loadTitle": "Carga fichero de datos",
	"loadSubtitle": "Carga los ficheros de datos de tus datos propios y el fichero de la encuesta de referencia para validar y comparar los datos.",
	"loadStep1": "Cargar fichero - Mi encuesta",
	"loadStep2": "Cargar fichero - Datos auxiliares",
	"loadOption1": "Cargar mi encuesta",
	"loadOption1Subtitle": "Carga tu fichero de la encuesta para realizar el estudio.",
	"loadOption2": "Cargar datos auxiliares",
	"loadOption2Subtitle": "Cargar datos auxiliares para comparar con los propios.",
	"fileSelect": "Selecciona el <b>archivo elegido</b> *.xlsx para cargar.",
	"fileButton": "Cargar archivo",
	"fileButtonSubtitle": "El archivo debe tener la extensión *.xlsx",
	"loadFile1Title": "Datos propios",
	"loadFile1Subtitle": "Descripción de qué fichero correspondería a los \"datos propios\".",
	"loadFile1Action": "Cargar fichero de datos propios",
	"loadFile1ActionHelp": "Texto de ayuda que acompaña a \"Cargar fichero de datos propios\"",
	"loadFile2Title": "Datos auxiliares",
	"loadFile2Subtitle": "Descripción de qué fichero correspondería a los \"datos auxiliares\".",
	"loadFile2Action": "Cargar fichero de datos auxiliares",
	"loadFile2ActionHelp": "Texto de ayuda que acompaña a \"Cargar fichero de datos auxiliares\"",
	"loadFile2Subaction": "Indicar variable de pesos",
	"loadFile2SubactionSubtitle": "Subtítulo de \"Indicar variable de pesos\"",
	"loadFile2SubactionHelp": "Texto de ayuda de \"Indicar variable de pesos\"",
	"loadFileError": "Error al cargar el archivo. Compruebe que el formato es correcto y vuelva a intentarlo.",
	"loadFileConfirm": "Validar datos",
	"loadFileLoading": "Espere un momento mientras se contrastan los datos de ambos archivos",
	"loadFileFinalError": "Error al contrastar los archivos",
	"noWeights": "Sin variable de pesos",
	"noFileTitle": "Insertar totales",
	"noFileSubtitle": "No dispongo de una fuente de datos auxiliares pero sí de unos totales que me gustaría contrastar con mi encuesta.",
	"noFileSubSubtitle": "Otro texto para confirmar \"Insertar totales\"",
	"noFileConfirm": "Insertar totales",
	"loadedFilesTitle": "¡Tenemos todo listo! Ya hemos contrastado los datos de ambos ficheros",
	"loadedFilesSubtitle": "En el proceso de armonización de los datos hemos localizados <b>$nVars variables aparentemente armonizadas</b>. Si quieres tener más datos armonizados, puedes descargar cualquiera de los ficheros desde el botón de \"Acciones\", realizar las modificaciones necesarias y cargarlos de nuevo desde esta pantalla.",
	"loadNewData": "Cargar nuevos datos",
	"downloadData": "Descargar datos",
	"download1Title": "Descargar datos propios",
	"download1Subtitle": "Subtítulo de \"Descargar datos propios\".",
	"download2Title": "Descargar datos auxiliares",
	"download2Subtitle": "Subtítulo de \"Descargar datos auxiliares\".",
	"downloadFilename": "Nombre del archivo",
	"downloadFormat": "¿En qué formato quieres descargarla?",
	"downloadFormatPlaceholder": "Selecciona una extensión de archivo",
	"downloadConfirm": "Guardar archivo",
	"downloadLoading": "Espere un momento mientras preparamos el archivo",
	"downloadError": "Error al descargar el archivo",
	"export1": "Exportar datos propios",
	"export2": "Exportar datos auxiliares",
	"variables": "Variables",
	"typeReason": "Las variables no pueden estar armonizadas porque no son del mismo tipo.",
	"categoriesReason": "Las variables no pueden estar armonizadas porque no tienen las mismas categorías.",
	"weightReason": "Las variables no pueden estar armonizadas porque se trata de una variable de pesos.",
	"missingReason": "Las variables no pueden estar armonizadas porque una tiene valores perdidos y la otra no.",
	"mean": "Media",
	"deviation": "Desviación típica",
	"max": "Máximo",
	"min": "Mínimo",
	"missing": "Valores perdidos",
	"insertTotals": "Insertar totales",
	"editTotals": "Editar totales",
	"editTotalsSubtitle": "Subtítulo con la descripción de editar totales",
	"deleteTotals": "Vaciar datos",
	"setTotals": "Actualizar",
	"missingError": "No se puede usar una variable con valores perdidos para calibrar",
	"totals1": "Totales de datos propios",
	"totals2": "Totales de datos auxiliares",
	"total": "Suma total",
	"inferTotals": "Inferir de la muestra de referencia",
	"weightTitle": "Parámetros de ponderación",
	"emptyTitle": "Sin datos",
	"emptyDescription": "Para poder realizar el proceso de ponderación debes marcar las <b>variables armonizadas o con totales</b> con las que quieres trabajar en la pestaña de <b>Datos</b>.",
	"method": "Método",
	"methodTitle": "¿Qué es un método?",
	"methodDescription": "Texto que responde a \"¿Qué es un método?\".",
	"methodPlaceholder": "Selecciona el método a aplicar",
	"methodExplain": "¿Qué es?",
	"methodExplainTitle": "Detalles del método",
	"methodExplainDescription": "Este apartado da información adicional sobre el método escogido.",
	"calibration": "Calibración",
	"calibrationTitle": "Método de calibración",
	"calibrationDescription": "La técnica de calibración <a href=\"https://doi.org/10.2307/2290268\" target=\"_blank\" rel=\"noopener\">(Deville y Särndal, 1992)</a> es un método de reponderación en el que los nuevos pesos deben de cumplir que la estimación del total poblacional que se realice con ellos para las variables auxiliares coincida con los totales reales de dichas variables. Al mismo tiempo, estos pesos tienen que ser lo más similares posible a los pesos de diseño originales de la encuesta que se quiere calibrar, lo cual se hace minimizando una función distancia entre los pesos originales y los nuevos. En <a href=\"https://doi.org/10.2307/2290268\" target=\"_blank\" rel=\"noopener\">Deville y Särndal (1992)</a> se enuncian distintas alternativas para la función distancia. La que se emplea aquí es la distancia Raking <a href=\"https://doi.org/10.2307/2290793\" target=\"_blank\" rel=\"noopener\">(Deville, Särndal y Sautory, 1993)</a>, la cual asegura que los totales estimados para los cruces de variables también coincidan con los totales esperados para dichos cruces en la población. En la práctica es el método de reponderación más usado por los organismos oficiales de encuestas.",
	"calibrationMissing": "Para poder aplicar calibración hay que seleccionar una variable de pesos iniciales o indicar el tamaño de la población.",
	"calibrationError": "Error al calibrar los totales dados. Compruebe que los totales especificados para las distintas variables sean coherentes entre sí.",
	"psa": "PSA con regresión logística",
	"psaTitle": "Propensity Score Adjustment con regresión logística",
	"psaDescription": "El Propensity Score Adjustment (<a href=\"https://www.scb.se/contentassets/ca21efb41fee47d293bbee5bf7be7fb3/propensity-score-adjustment-as-a-weighting-scheme-for-volunteer-panel-web-surveys.pdf\" target=\"_blank\" rel=\"noopener\">Lee, 2006</a>; <a href=\"https://doi.org/10.1177/0049124108329643\" target=\"_blank\" rel=\"noopener\">Lee y Valliant, 2009</a>) es un método por el cual se estiman las probabilidades de participar (originalmente desconocidas) para los individuos de la encuesta no probabilística. Para ello, se combina ésta con una encuesta probabilística y se ajusta un modelo predictivo para predecir la probabilidad de que un individuo de la muestra combinada pertenezca a la muestra no probabilística. Este modelo predictivo puede ser una regresión logística o cualquier otro algoritmo predictivo; seleccionando esta opción, se emplea la regresión logística para la predicción de probabilidades. Dicha regresión requiere que no haya datos faltantes, por lo que se realiza imputación en cada una de las variables independientes. En las variables numéricas, se imputa a través de la mediana y se crea una variable nueva que indique si el dato es faltante o no (la cual se incluye en la regresión posterior). En las variables no numéricas, se crea una categoría nueva correspondiente a datos faltantes. En el caso de estas últimas, también se agrupan todas aquellas clases que no superen una frecuencia relativa del 5% en una única clase denominada “Infrecuentes”. Al ajustar los modelos, y siguiendo la pseudo log-verosimilitud empírica descrita en <a href=\"https://doi.org/10.1080/01621459.2019.1677241\" target=\"_blank\" rel=\"noopener\">Chen, Li y Wu (2020)</a>, se tienen en cuenta los pesos de diseño de la encuesta probabilística para que las probabilidades estén escaladas correctamente al conjunto de la población, en lugar de únicamente a la suma de individuos de ambas muestras (lo que daría lugar a probabilidades más grandes de la cuenta). Finalmente, las probabilidades se transforman en pesos a aplicar en la encuesta no probabilística. Se han estudiado diversas transformaciones en la literatura; en esta herramienta se emplea la fórmula: Pesos = (1 – Probabilidad)/Probabilidad, desarrollada en <a href=\"https://doi.org/10.1214/16-sts597\" target=\"_blank\" rel=\"noopener\">Schonlau y Couper (2017)</a>.",
	"psaError": "Error desconocido al aplicar Propensity Score Adjustment",
	"psaBoost": "PSA con Gradient Boosting",
	"psaBoostTitle": "Propensity Score Adjustment con Gradient Boosting",
	"psaBoostDescription": "El Propensity Score Adjustment (<a href=\"https://www.scb.se/contentassets/ca21efb41fee47d293bbee5bf7be7fb3/propensity-score-adjustment-as-a-weighting-scheme-for-volunteer-panel-web-surveys.pdf\" target=\"_blank\" rel=\"noopener\">Lee, 2006</a>; <a href=\"https://doi.org/10.1177/0049124108329643\" target=\"_blank\" rel=\"noopener\">Lee y Valliant, 2009</a>) es un método por el cual se estiman las probabilidades de participar (originalmente desconocidas) para los individuos de la encuesta no probabilística. Para ello, se combina ésta con una encuesta probabilística y se ajusta un modelo predictivo para predecir la probabilidad de que un individuo de la muestra combinada pertenezca a la muestra no probabilística. Este modelo predictivo puede ser una regresión logística o cualquier otro algoritmo predictivo; seleccionando esta opción, se emplea el algoritmo de aprendizaje automático Histogram-Based Gradient Boosting Classification Tree <a href=\"https://doi.org/10.1007/978-3-030-37334-4_4\" target=\"_blank\" rel=\"noopener\">(Guryanov, 2019)</a> para la predicción de probabilidades. Al ajustar los modelos, y siguiendo las instrucciones de ponderación del algoritmo de Gradient Boosting descritas en <a href=\"https://doi.org/10.1016/j.matcom.2024.06.012\" target=\"_blank\" rel=\"noopener\">Ferri-García et al. (2024)</a>, se tienen en cuenta los pesos de diseño de la encuesta probabilística para que las probabilidades estén escaladas correctamente al conjunto de la población, en lugar de únicamente a la suma de individuos de ambas muestras (lo que daría lugar a probabilidades más grandes de la cuenta). Finalmente, las probabilidades se transforman en pesos a aplicar en la encuesta no probabilística. Se han estudiado diversas transformaciones en la literatura; en esta herramienta se emplea la fórmula: Pesos = (1 – Probabilidad)/Probabilidad, desarrollada en <a href=\"https://doi.org/10.1214/16-sts597\" target=\"_blank\" rel=\"noopener\">Schonlau y Couper (2017)</a>. De esta manera, se tiene en cuenta que los individuos de la encuesta no probabilística no forman parte de la población objetivo de la encuesta probabilística.",
	"psaBoostError": "Error desconocido al aplicar Propensity Score Adjustment con Gradient Boosting",
	"kw": "KW",
	"kwTitle": "Kernel Weighting con regresión logística",
	"kwDescription": "El método de Kernel Weighting (<a href=\"https://doi.org/10.1111/rssa.12564\" target=\"_blank\" rel=\"noopener\">Wang et al., 2020</a>; <a href=\"https://doi.org/10.1093/jssam/smaa028\" target=\"_blank\" rel=\"noopener\">Kern et al., 2021</a>) utiliza las probabilidades de participar en la muestra no probabilística que proporciona el método PSA. Concretamente, calcula las diferencias en dicha probabilidad entre cada unidad de la muestra probabilística y cada unidad de la muestra no probabilística. Estas diferencias se suavizan utilizando una función Kernel, y los pesos finales para un individuo de la muestra no probabilística se obtienen sumando los pesos de diseño de cada unidad de la muestra probabilística multiplicados por la diferencia suavizada de esa unidad con la unidad de la muestra no probabilística cuyo peso vamos a obtener. En esta opción, las probabilidades de participación obtenidas con el PSA se estiman utilizando un modelo de regresión logística; puede consultar más información sobre este método seleccionando la opción \"PSA con regresión logística\"",
	"kwError": "Aplicar Kernel weighting consume una gran cantidad de memoria que puede superar los límites del navegador. Pruebe a utilizar directamente <a href=\"https://pypi.org/project/inps/\" target=\"_blank\" rel=\"noopener\">INPS</a>.",
	"kwBoost": "KW avanzado",
	"kwBoostTitle": "Kernel Weighting con Gradient Boosting",
	"kwBoostDescription": "El método de Kernel Weighting (<a href=\"https://doi.org/10.1111/rssa.12564\" target=\"_blank\" rel=\"noopener\">Wang et al., 2020</a>; <a href=\"https://doi.org/10.1093/jssam/smaa028\" target=\"_blank\" rel=\"noopener\">Kern et al., 2021</a>) utiliza las probabilidades de participar en la muestra no probabilística que proporciona el método PSA. Concretamente, calcula las diferencias en dicha probabilidad entre cada unidad de la muestra probabilística y cada unidad de la muestra no probabilística. Estas diferencias se suavizan utilizando una función Kernel, y los pesos finales para un individuo de la muestra no probabilística se obtienen sumando los pesos de diseño de cada unidad de la muestra probabilística multiplicados por la diferencia suavizada de esa unidad con la unidad de la muestra no probabilística cuyo peso vamos a obtener. En esta opción, las probabilidades de participación obtenidas con el PSA se estiman utilizando el algoritmo de aprendizaje automático Histogram-Based Gradient Boosting Classification Tree <a href=\"https://doi.org/10.1007/978-3-030-37334-4_4\" target=\"_blank\" rel=\"noopener\">(Guryanov, 2019)</a>; puede consultar más información sobre este método seleccionando la opción \"PSA con Gradient Boosting\"",
	"kwBoostError": "Aplicar Kernel Weighting con Gradient Boosting consume una gran cantidad de memoria que puede superar los límites del navegador. Pruebe a utilizar directamente <a href=\"https://pypi.org/project/inps/\" target=\"_blank\" rel=\"noopener\">INPS</a>.",
	"origWeights": "Variable de pesos originales",
	"origWeightsTitle": "Variable de pesos originales",
	"origWeightsDescription": "Descripción de \"Variable de pesos originales\".",
	"uniformWeights": "Pesos uniformes",
	"popSize": "Población objetivo",
	"popSizeTitle": "Tamaño de la población objetivo",
	"popSizeDescription": "Número de individuos total de la población sobre la que se ha obtenido la muestra. En caso de haber disponibles unos datos auxiliares, se aplica por defecto el valor inferido de éstos en función de la variable de pesos seleccionada. Se trata del mismo total poblacional sobre el que se infieren los totales de variables, por lo que no debe cambiarse si se trabaja con totales inferidos. Para el resto de métodos puede dejarse en blanco y se calcularán pesos relativos.",
	"popSizePlaceholder": "Ej. 11456",
	"activeVars": "Variables usadas en el método",
	"changeVars": "Cambiar variables seleccionadas",
	"newVar": "Nombre de la variable del peso ajustado",
	"newVarPlaceholder": "Ej. pesos_psa1",
	"weightButton": "Realizar cálculo",
	"weightLoading": "Este proceso puede tardar unos minutos. Espere un momento mientras se calcula la nueva variable de pesos.",
	"estimatedWeightTitle": "¡Lo tenemos todo listo! Ya hemos realizado correctamente la ponderación.",
	"estimatedWeightSubtitle": "Hemos incluido en la base de datos de \"Datos propios\" la variable de pesos \"$name\". Puedes consultarla abajo o si lo deseas descargar la base de datos desde el botón de la parte superior.",
	"estimationTitle": "Evaluar estimaciones",
	"targetVar": "Variable objetivo",
	"selectVar": "Seleccionar variable",
	"estimationMethod": "Método de estimación",
	"estimationMethodDescription": "Texto de ayuda para \"Método de estimación\". Para poder optimizar las estimaciones hay que haber seleccionado variables armonizadas. Cuando se activa, si los pesos son uniformes se aplica Matching y en caso contrario se aplica Training.",
	"noMatching": "Sin optimizar",
	"linearMatching": "Regresión lineal",
	"boostedMatching": "Gradient Boosting",
	"compare": "Comparar",
	"compareVar": "Variable de pesos a comparar",
	"compareMethod": "Método de estimación a comparar",
	"estimate": "Realizar estimación",
	"emptyEstimation": "Seleccione una variable del desplegable <b>\"Variable objetivo\"</b> para ver estimaciones",
	"estimationLoading": "Este proceso puede tardar unos minutos. Espere un momento mientras se calculan las estimaciones.",
	"estimationError": "Error al cargar las estimaciones",
	"estimationHeader": "Estimaciones",
	"comparedHeader": "Estimaciones según diferentes pesos",
	"numericEstimation": "Estimación",
	"percentageEstimation": "Estimación %",
	"numericInterval": "95% IC",
	"pertentageInterval": "95% IC",
	"mainEstimation": "Pesos calculados",
	"altEstimation": "Pesos a comparar"
}
